# Basic Programming
## Solutions of Pre-test

This is pre-test for basic Programming class at Telkomsel<br>
Trainer: B. Ari Kuncoro <br>
Dataset: IMDB <br>
Objective: To explore data of IMDB, using pandas and numpy packages. <br>
Date: 30 Sep 2019

### Import Modules

In [1]:
import pandas as pd
import numpy as np

### Load and Check Dataset

In [2]:
imdb = pd.read_csv("https://raw.githubusercontent.com/scalabretta/GroupProject--IMDB/master/Dataset/IMDB-database-update.csv", encoding='latin1')
imdb.head()

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
0,1,Avatar,178,1,2009,USA,English,PG-13,237000000,760505847,...,1,855,4834,1,33000,0,886204,3054,7.9,0
1,2,Pirates of the Caribbean: At World's End,169,1,2007,USA,English,PG-13,300000000,309404152,...,1,1000,48350,0,0,0,471220,1238,7.1,0
2,3,The Dark Knight Rises,164,1,2012,USA,English,PG-13,250000000,448130642,...,1,23000,106759,1,164000,0,1144337,2701,8.5,1
3,4,Spider-Man 3,156,1,2007,USA,English,PG-13,258000000,336530303,...,1,4000,46055,0,0,0,383056,1902,6.2,0
4,5,Batman v Superman: Dawn of Justice,183,1,2016,USA,English,PG-13,250000000,330249062,...,1,2000,24450,1,197000,0,371639,3018,6.9,0

### 1. How many rows and columns?

There are 36 columns and 3781 rows.

In [3]:
#column
print("kolom:",len(imdb.columns))
#row
print("baris:",len(imdb))

kolom: 36
baris: 3781

### 2. What are the top 3 movies with highest nett profit in 2015?

In [7]:
# imdb.dtypes
imdb_2015=imdb[imdb.title_year==2015]
year_2015=imdb_2015.sort_values('net_USD', ascending=False)
year_2015.loc[:,['movie_title','net_USD']].head(4)

                  movie_title    net_USD
14             Jurassic World  502177271
256                   Minions  262029560
3384  Avengers: Age of Ultron  208991599
1600               Inside Out  181454367

### 3. What are the top 3 movies with highest gross profit in 2016

In [9]:
imdb_2016=imdb[imdb.title_year==2016]
year_2016=imdb_2016.sort_values('gross_USD', ascending=False)
year_2016.loc[:,['movie_title','gross_USD']].head(9)

                             movie_title  gross_USD
12            Captain America: Civil War  407197282
355                             Deadpool  363024263
36                       The Jungle Book  362645141
694                      The Jungle Book  362645141
4     Batman v Superman: Dawn of Justice  330249062
235              The Secret Life of Pets  323505540
3713                       Suicide Squad  161087183
3626                   X-Men: Apocalypse  154985087
74                       Kung Fu Panda 3  143523463

### 4. How many non-english movies are in the dataset?

In [24]:
print("There are " + str(len(imdb[imdb.language!='English']))+ " non-english movies.")

There are 153 non-english movies

In [16]:
h = imdb[imdb.language!='English']
len(h.movie_title.unique())

152

### 5.What are top 3 languages in the dataset aside English (based on number of movies)?
1. French 
2. Spanish 
3. Mandarin

In [21]:
imdb_non_eng =imdb[imdb.language!='English']
imdb_non_eng['language'].value_counts().head(3)

French      33
Spanish     23
Mandarin    14
Name: language, dtype: int64

### 6.What are the top 3 countries with the highest nett profit in all dataset times?
1. USA 
2. UK 
3. Australia

In [30]:
# group by function
top_3=imdb[['country','movie_title','net_USD']]
top_3.groupby('country').sum().sort_values('net_USD', ascending=False).head(3)

               net_USD
country
USA        52003933174
UK          1531614524
Australia    252571616

### 7.What are the average budget of all movies in dataset in 2015?

In [23]:
imdb_2015=imdb[imdb.title_year==2015]
budget_2015 = imdb_2015['budget_USD'].mean()
print("The average budget of all movies in dataset in 2015 is USD " + str(budget_2015))

The average budget of all movies in dataset in 2015 is USD 55471931.81818182

### 8.What are the average budget of all movies in dataset in 2016?

In [24]:
imdb_2016=imdb[imdb.title_year==2016]
budget_2016 = imdb_2016['budget_USD'].mean()
print("The average budget of all movies in dataset in 2016 is USD "+ str(budget_2016))

The average budget of all movies in dataset in 2016 is USD 69225757.57575758

### 9.Which one is higher, average budget of all movies in dataset in 2015 or 2016

In [27]:
if budget_2016 > budget_2015:
    print("The average budget of all movies in dataset 2016 is higher than in 2015")
else :
    print("The average budget of all movies in dataset 2015 is higher than in 2016")

The average budget of all movies in dataset 2016 is higher than in 2015

### 10.What movie that resulted highest nett profit of all dataset times? How much did the movie make? 

Avatar resulted highest nett profit. It made USD 523,505,847.

In [28]:
# highest_nett=imdb[['movie_title','net_USD']]
# highest_nett.groupby('movie_title').sum().sort_values('net_USD', ascending=False).head(1)

highest_nett=imdb.sort_values('net_USD', ascending=False).head(1)
highest_nett[['movie_title','net_USD']]

  movie_title    net_USD
0      Avatar  523505847